{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_24", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "bidirectional_51_input"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_51", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20, 1], "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_67", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 40, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_66", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_52", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_68", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 40, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_67", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_53", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_69", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 40, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_68", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_51/forward_lstm_67/lstm_cell/kernel", "shape": [1, 160], "dtype": "float32"}, {"name": "bidirectional_51/forward_lstm_67/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_51/forward_lstm_67/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "bidirectional_51/backward_lstm_67/lstm_cell/kernel", "shape": [1, 160], "dtype": "float32"}, {"name": "bidirectional_51/backward_lstm_67/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_51/backward_lstm_67/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "bidirectional_52/forward_lstm_68/lstm_cell/kernel", "shape": [80, 160], "dtype": "float32"}, {"name": "bidirectional_52/forward_lstm_68/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_52/forward_lstm_68/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "bidirectional_52/backward_lstm_68/lstm_cell/kernel", "shape": [80, 160], "dtype": "float32"}, {"name": "bidirectional_52/backward_lstm_68/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_52/backward_lstm_68/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "bidirectional_53/forward_lstm_69/lstm_cell/kernel", "shape": [80, 160], "dtype": "float32"}, {"name": "bidirectional_53/forward_lstm_69/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_53/forward_lstm_69/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "bidirectional_53/backward_lstm_69/lstm_cell/kernel", "shape": [80, 160], "dtype": "float32"}, {"name": "bidirectional_53/backward_lstm_69/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "bidirectional_53/backward_lstm_69/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [80, 2], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [2], "dtype": "float32"}]}]}